; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-12)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(free left)
(free right)
(at ball1 rooma)
(at ball2 roomb)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 room4)
(at ball8 room4)
(at ball9 room5)
(at ball10 room5)
(at ball11 room5)
(at ball12 room5)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 roomb)
(at ball4 room3)
(at ball5 room3)
(at ball6 room4)
(at ball7 room4)
(at ball8 room5)
(at ball9 room5)
(at ball10 room5)
(at ball11 room5)
(at ball12 room5)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 7 of 12
2. (pick ball6 roomb left)
   deleted: (at ball6 roomb) (free left)
   added: (carry ball6 left)
   goals met: 7 of 12
3. (pick ball5 roomb right)
   deleted: (at ball5 roomb) (free right)
   added: (carry ball5 right)
   goals met: 7 of 12
4. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 7 of 12
5. (drop ball6 room4 left)
   deleted: (carry ball6 left)
   added: (at ball6 room4) (free left)
   goals met: 8 of 12
6. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 8 of 12
7. (drop ball5 room3 right)
   deleted: (carry ball5 right)
   added: (at ball5 room3) (free right)
   goals met: 9 of 12
8. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 9 of 12
9. (pick ball4 roomb left)
   deleted: (at ball4 roomb) (free left)
   added: (carry ball4 left)
   goals met: 9 of 12
10. (pick ball2 roomb right)
   deleted: (at ball2 roomb) (free right)
   added: (carry ball2 right)
   goals met: 9 of 12
11. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 9 of 12
12. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 9 of 12
13. (drop ball4 room3 left)
   deleted: (carry ball4 left)
   added: (at ball4 room3) (free left)
   goals met: 10 of 12
14. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 10 of 12
15. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 10 of 12
16. (pick ball8 room4 left)
   deleted: (at ball8 room4) (free left)
   added: (carry ball8 left)
   goals met: 10 of 12
17. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 10 of 12
18. (drop ball8 room5 left)
   deleted: (carry ball8 left)
   added: (at ball8 room5) (free left)
   goals met: 11 of 12
19. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 11 of 12
20. (drop ball2 rooma right)
   deleted: (carry ball2 right)
   added: (at ball2 rooma) (free right)
   goals met: 12 of 12
